app/controllers/colleges_controller.rb

INSERT INTO `colleges` (`name`, `city`, `updated_at`, `review`, `state`, `created_at`) VALUES('Kalpataru Institute Of Technology', 'Tiptur', '2009-03-09 09:39:33', 1, 'Karnataka', '2009-03-09 09:39:33')
---
    def create
        @college = College.new(params[:college])
        @college.name = @college.name.gsub(/^[a-z]|\s+[a-z]/) { |a| a.upcase }
        @college.city = @college.city.gsub(/^[a-z]|\s+[a-z]/) { |a| a.upcase }
        @college.state = @college.state.gsub(/^[a-z]|\s+[a-z]/) { |a| a.upcase }
        @college.review = true

        respond_to do |format|
            if simple_captcha_valid?
              if @college.save

SELECT * FROM `colleges` ORDER BY name asc LIMIT 0, 15
SELECT count(*) AS count_all FROM `colleges`
---
    def all
        @colleges= College.paginate :per_page => 15, :page => params[:page], :order => 'name asc'

SELECT * FROM `colleges` WHERE (`colleges`.`id` = 2)
SELECT * FROM `professors` WHERE (`professors`.`college_id` = 2) ORDER BY firstName asc
---
    def show
        @college = College.find(params[:id])

        @professorList = Professor.find(:all, :conditions => {:college_id => @college.id}, :order => 'firstName asc')