app/controllers/home_controller.rb

    def index
        if params[:name]
            if params[:name].strip.length != 0
#                @colleges = College.search params[:name].strip
              @colleges = College.paginate :per_page => 10, :page => params[:page],
                                           :conditions => ['name like ?', "%#{params[:name].strip}%"],
                                           :order => 'name'
---
SELECT * FROM `colleges` WHERE (name like '%myte%') ORDER BY name LIMIT 0, 10
SELECT count(*) AS count_all FROM `colleges` WHERE (name like '%a%')

    def search
        if params[:name]
            if params[:name].strip.length != 0
#                @colleges = College.search params[:name].strip
              @colleges = College.paginate :per_page => 10, :page => params[:page],
                                           :conditions => ['name like ?', "%#{params[:name].strip}%"],
                                           :order => 'name',
                                           :group => 'name'
---
SELECT * FROM `colleges` WHERE (name like '%m%') GROUP BY name ORDER BY name LIMIT 0, 10
SELECT count(*) AS count_all, name AS name FROM `colleges` WHERE (name like '%m%') GROUP BY name