app/controllers/professors_controller.rb

    def new
        @professor = Professor.new
        @college = College.find_by_id params[:id]
---
SELECT * FROM `colleges` WHERE (`colleges`.`id` = '13') LIMIT 1

    def create
        logger.info "**********************************************************************"
        @professor = Professor.new(params[:professor])
        # Department is obtained from ajax from department model and it won't be
        # populated in professor. So, manually set it.
        @professor.department = params[:department]

        # Capitalize the first character of each string in prof name
        @professor.firstName = @professor.firstName.gsub(/^[a-z]|\s+[a-z]/) { |a| a.upcase }
        @professor.lastName = @professor.lastName.gsub(/^[a-z]|\s+[a-z]/) { |a| a.upcase }
        @professor.department = @professor.department.gsub(/^[a-z]|\s+[a-z]/) { |a| a.upcase }

        @professor.college_id = params[:college_id]
        @professor.review = true
        @college = College.find_by_id params[:college_id]
        logger.info "**********************************************************************"
        respond_to do |format|
            if simple_captcha_valid?
              if @professor.save
---
SELECT `professors`.id FROM `professors` WHERE (`professors`.`firstName` = BINARY 'Mahesh' AND `professors`.lastName = 'Murthy' AND `professors`.college_id = 2 AND `professors`.department = 'Computer Science') LIMIT 1
SELECT * FROM `colleges` WHERE (`colleges`.`id` = '2') LIMIT 1
INSERT INTO `professors` (`department`, `lastName`, `updated_at`, `review`, `firstName`, `college_id`, `created_at`) VALUES('Computer Science', 'Murthy', '2009-03-09 01:02:22', 1, 'Mahesh', 2, '2009-03-09 01:02:22')

    def show
        @professor = Professor.find(params[:id])
        # Grab all the ratings of this professor
        #@ratings = Rating.find(:all, :conditions => {:professor_id => @professor.id, :pending => 1}, :order => 'created_at desc')
        @ratings = Rating.paginate :per_page => 10, :page => params[:page],
                                           :conditions => {:professor_id => @professor.id},
                                           :order => 'created_at desc'
---
SELECT * FROM `professors` WHERE (`professors`.`id` = 1)
SELECT * FROM `ratings` WHERE (`ratings`.`professor_id` = 1) ORDER BY created_at desc LIMIT 0, 10