app/controllers/ratings_controller.rb

SELECT * FROM `ratings` WHERE (`ratings`.`pending` = 1)
---
  def index
    unless (logged_in? && authorized?)
      redirect_back_or_default('/')
      return
    end
    @ratings = Rating.find(:all, :conditions => {:pending => true})

SELECT * FROM `ratings` WHERE (`ratings`.`id` = 1)
UPDATE `ratings` SET `updated_at` = '2009-03-29 15:45:37', `pending` = 0 WHERE `id` = 1
SELECT * FROM `ratings` WHERE (`ratings`.`pending` = 1)
---
  def approve
    @rating = Rating.find(params[:id])
    @rating.update_attribute :pending, "false"
    @ratings = Rating.find(:all, :conditions => {:pending => true})

SELECT * FROM `professors` WHERE (`professors`.`id` = 3)
---
  def new
    @professor = Professor.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 14) LIMIT 1
---
  def create
    unless simple_captcha_valid?
        flash[:notice] = 'Please make sure the entered the characters in the image correctly and try again.'
        respond_to do |format|
          format.html { render :action => "new" }
        end
    else
    @professor = session[:professor]
    @rating = Rating.new
    @rating.q1 = params[:q0].to_i
    @rating.q2 = params[:q1].to_i
    @rating.q3 = params[:q2].to_i
    @rating.q4 = params[:q3].to_i
    @rating.comments = params[:comments]
    @rating.college_id = @professor.college_id
    @rating.professor_id = @professor.id
    if @rating.comments == ""
      @rating.pending = false
    else
      @rating.pending = true
    end
    if params[:showname]
      @rating.showname = false
    else
      @rating.showname = true
    end
    user = User.find_by_id(session[:user_id])

INSERT INTO `ratings` (`professor_id`, `q1`, `q2`, `pending`, `updated_at`, `showname`, `q3`, `comments`, `q4`, `q5`, `college_id`, `avg`, `login`, `created_at`) VALUES(3, 3, 3, 1, '2009-03-09 03:54:47', 1, 3, 'good lect ...', 3, NULL, 23, 3.0, 'vatsa', '2009-03-09 03:54:47')
---
    end
    @rating.avg = (@rating.q1 + @rating.q2 + @rating.q3 + @rating.q4) / 4.0
    respond_to do |format|
      if @rating.save