app/controllers/users_controller.rb

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    begin
      @user.save
---
INSERT INTO `users` (`salt`, `updated_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `activation_code`, `password_reset_code`, `remember_token`, `login`, `email`, `created_at`) VALUES('15c6d1e5ac0063257757d869534e1de144d48416', '2009-03-01 02:28:18', NULL, '3a4e0f737177378598cc7069a8f3fe918ec6ebec', NULL, 'de39f17a1dfaa986600fe05adf7f4a646afc93cc', NULL, NULL, 'naveenl', 'naveenlokanath@gmail.com', '2009-03-01 02:28:18')

  def activate
    self.current_user = params[:activation_code].blank? ? false : User.find_by_activation_code(params[:activation_code])
---
SELECT * FROM `users` WHERE (`users`.`activation_code` = 'de39f17a1dfaa986600fe05adf7f4a646afc93cc') LIMIT 1

  def forgot_password
    return unless request.post?
    logger.info "Came here"
    if @user = User.find_by_email(params[:user][:email])
      @user.forgot_password
      @user.save
---
SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`email`) = BINARY 'vatsamail@gmail.com' AND `users`.id <> 14) LIMIT 1
UPDATE `users` SET `password_reset_code` = '94fae9e21fb68140eac3c2f1d0b9f7a524926fc1', `updated_at` = '2009-03-09 03:42:14' WHERE `id` = 14

  def reset_password
    @user = User.find_by_password_reset_code(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`password_reset_code` = '94fae9e21fb68140eac3c2f1d0b9f7a524926fc1') LIMIT 1